Radolini3/stm32/Core/Src/lcd_i2c.c
/* The MIT License
 *
 * Copyright (c) 2020 Piotr Duba
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */
#include "main.h"
#include "lcd_i2c.h"
#include "stm32f3xx_hal.h"
#include "i2c.h"

#include "globalVars.h"
#include "stdio.h"
#include "string.h"

void lcd_init(struct lcd_disp * lcd){
	uint8_t xpin = 0;
	/* set backlight */
	if(lcd->bl){
		xpin = BL_PIN;
	}

	/* init sequence */
	delay_us(40000);
	lcd_write(lcd->addr, INIT_8_BIT_MODE, xpin);
	delay_us(5000);
	lcd_write(lcd->addr, INIT_8_BIT_MODE, xpin);
	delay_us(10000);
	lcd_write(lcd->addr, INIT_8_BIT_MODE, xpin);

	/* set 4-bit mode */
	lcd_write(lcd->addr, INIT_4_BIT_MODE, xpin);

	/* set cursor mode */
	lcd_write(lcd->addr, UNDERLINE_OFF_BLINK_OFF, xpin);

	/* clear */
	lcd_clear(lcd);

}

void lcd_write(uint8_t addr, uint8_t data, uint8_t xpin){
	uint8_t tx_data[4];

	/* split data */
	tx_data[0] = (data & 0xF0) | EN_PIN | xpin;
	tx_data[1] = (data & 0xF0) | xpin;
	tx_data[2] = (data << 4) | EN_PIN | xpin;
	tx_data[3] = (data << 4) | xpin;

	/* send data via i2c */
	HAL_I2C_Master_Transmit(&HI2C_DEF, addr, tx_data, 4, 100);

	delay_us(750);
}

void lcd_display(struct lcd_disp * lcd){
	uint8_t xpin = 0, i = 0;

	/* set backlight */
	if(lcd->bl){
		xpin = BL_PIN;
	}

	lcd_clear(lcd);

	/* send first line data */
	lcd_write(lcd->addr, FIRST_CHAR_LINE_1, xpin);

	while(lcd->f_line[i]){
		lcd_write(lcd->addr, lcd->f_line[i], (xpin | RS_PIN));
		i++;
	}

	/* send second line data */
	i = 0;
	lcd_write(lcd->addr, FIRST_CHAR_LINE_2, xpin);

	while(lcd->s_line[i]){
		lcd_write(lcd->addr, lcd->s_line[i], (xpin | RS_PIN));
		i++;
	}
}

void lcd_clear(struct lcd_disp * lcd)
{
	uint8_t xpin = 0;

	/* set backlight */
	if(lcd->bl){
		xpin = BL_PIN;
	}

	/* clear display */
	lcd_write(lcd->addr, CLEAR_LCD, xpin);
}
void displayReadings(int disp_No){
	switch(disp_No){
	case 1:
	  sprintf((char *)disp.f_line, "HSens1: %2.f%%", moisture_percentage[0]);
	  sprintf((char *)disp.s_line, "HSens2: %2.f%%", moisture_percentage[1]);
		break;
	case 2:
	  sprintf((char *)disp.f_line, "HSens3: %2.f%%", moisture_percentage[2]);
	  sprintf((char *)disp.s_line, "HSens4: %2.f%%", moisture_percentage[3]);
		break;
	case 3:
	  sprintf((char *)disp.f_line, "HSens5: %2.f%%", moisture_percentage[4]);
	  sprintf((char *)disp.s_line, "HSens6: %2.f%%", moisture_percentage[5]);
		break;
	case 4:
	  sprintf((char *)disp.f_line, "AirT: %2.f degC", Temperature);
	  sprintf((char *)disp.s_line, "AirH: %2.f%% ", Humidity);
		break;
	case 5:
	  sprintf((char *)disp.f_line, "LightInt: %2.f%%", lightIntensity);
	  sprintf((char *)disp.s_line, " ");
		break;
	default:
		break;
	}
	lcd_display(&disp);
}

